In [4]:
import numpy as np
import pandas as pd

In [15]:
from numpy.random import randn

In [12]:
np.random.seed(101)

In [17]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [15]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [19]:
type(df['W'])

pandas.core.series.Series

In [21]:
type(df)

pandas.core.frame.DataFrame

In [23]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [32]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [83]:
df['new'] = df['W'] + df['Y']

In [85]:
df.drop('new',axis=1,inplace=True)

In [53]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [87]:
df.drop('E',axis=0)

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [89]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [91]:
df.shape

(5, 4)

In [101]:
df[['Z','X']]

          Z         X
A  0.000366  0.196800
B  0.649826 -0.156598
C -0.346419 -0.610259
D  1.024810 -0.479448
E  0.610478  1.862864

In [103]:
# ROWS

In [16]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [111]:
df.loc['A']

W   -0.993263
X    0.196800
Y   -1.136645
Z    0.000366
Name: A, dtype: float64

In [113]:
df.iloc[0]

W   -0.993263
X    0.196800
Y   -1.136645
Z    0.000366
Name: A, dtype: float64

In [117]:
df.loc['C','Y']

-0.755325340010558

In [121]:
df.iloc[4,3]

0.6104779075384634

In [18]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
df.loc[['A','B'],['W','X','Y','Z']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [26]:
df.iloc[[0,1],[0,1,2,3]]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [30]:
booldf = df>0

In [32]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
 df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [40]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [44]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
df

          W         X         Y         Z
A  0.001743  1.099820  0.804340 -0.450427
B  1.175557 -1.321893  1.223023 -0.056114
C  1.605519 -0.015625  0.619537  1.318066
D -0.404358  1.926836  0.238189 -1.276119
E  0.887088  0.385505 -2.164837 -2.609091

In [18]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
B  1.175557 -1.321893  1.223023 -0.056114

In [22]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  0.001743  1.099820  0.804340 -0.450427
B  1.175557 -1.321893  1.223023 -0.056114
C  1.605519 -0.015625  0.619537  1.318066
E  0.887088  0.385505 -2.164837 -2.609091

In [26]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.001743  1.099820  0.804340 -0.450427
1     B  1.175557 -1.321893  1.223023 -0.056114
2     C  1.605519 -0.015625  0.619537  1.318066
3     D -0.404358  1.926836  0.238189 -1.276119
4     E  0.887088  0.385505 -2.164837 -2.609091

In [28]:
newind = 'CA NY WY OR CO'.split()

In [30]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [32]:
df['States'] = newind

In [34]:
df

          W         X         Y         Z States
A  0.001743  1.099820  0.804340 -0.450427     CA
B  1.175557 -1.321893  1.223023 -0.056114     NY
C  1.605519 -0.015625  0.619537  1.318066     WY
D -0.404358  1.926836  0.238189 -1.276119     OR
E  0.887088  0.385505 -2.164837 -2.609091     CO

In [36]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.001743  1.099820  0.804340 -0.450427
NY      1.175557 -1.321893  1.223023 -0.056114
WY      1.605519 -0.015625  0.619537  1.318066
OR     -0.404358  1.926836  0.238189 -1.276119
CO      0.887088  0.385505 -2.164837 -2.609091

In [38]:
df

          W         X         Y         Z States
A  0.001743  1.099820  0.804340 -0.450427     CA
B  1.175557 -1.321893  1.223023 -0.056114     NY
C  1.605519 -0.015625  0.619537  1.318066     WY
D -0.404358  1.926836  0.238189 -1.276119     OR
E  0.887088  0.385505 -2.164837 -2.609091     CO

In [40]:
resultdf = df[df['W']>0]

In [42]:
resultdf

          W         X         Y         Z States
A  0.001743  1.099820  0.804340 -0.450427     CA
B  1.175557 -1.321893  1.223023 -0.056114     NY
C  1.605519 -0.015625  0.619537  1.318066     WY
E  0.887088  0.385505 -2.164837 -2.609091     CO

In [44]:
resultdf['Y']

A    0.804340
B    1.223023
C    0.619537
E   -2.164837
Name: Y, dtype: float64

In [48]:
df[df['W']>0]['Y']

A    0.804340
B    1.223023
C    0.619537
E   -2.164837
Name: Y, dtype: float64

In [50]:
boolser = df['W']>0

In [52]:
boolser

A     True
B     True
C     True
D    False
E     True
Name: W, dtype: bool

In [54]:
result = df[boolser]

In [56]:
result

          W         X         Y         Z States
A  0.001743  1.099820  0.804340 -0.450427     CA
B  1.175557 -1.321893  1.223023 -0.056114     NY
C  1.605519 -0.015625  0.619537  1.318066     WY
E  0.887088  0.385505 -2.164837 -2.609091     CO

In [58]:
df[df['W']>0]

          W         X         Y         Z States
A  0.001743  1.099820  0.804340 -0.450427     CA
B  1.175557 -1.321893  1.223023 -0.056114     NY
C  1.605519 -0.015625  0.619537  1.318066     WY
E  0.887088  0.385505 -2.164837 -2.609091     CO

In [60]:
mycols = ['Y','X']

In [62]:
mycols

['Y', 'X']

In [64]:
result[mycols]

          Y         X
A  0.804340  1.099820
B  1.223023 -1.321893
C  0.619537 -0.015625
E -2.164837  0.385505

In [78]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.804340  1.099820
B  1.223023 -1.321893
C  0.619537 -0.015625
E -2.164837  0.385505

In [6]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [8]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [19]:
df

          W         X         Y         Z
A  1.099137  1.023345  1.816936  0.930388
B -0.225240  0.451090 -0.039731  0.551300
C -0.094365  0.830831 -0.061162 -1.314209
D -1.130102  1.772006 -1.701121 -0.648829
E -0.363963 -1.315504  1.287543 -0.130651

In [23]:
df.index.names = ['Corridor']

In [25]:
df

                 W         X         Y         Z
Corridor
A         1.099137  1.023345  1.816936  0.930388
B        -0.225240  0.451090 -0.039731  0.551300
C        -0.094365  0.830831 -0.061162 -1.314209
D        -1.130102  1.772006 -1.701121 -0.648829
E        -0.363963 -1.315504  1.287543 -0.130651